create database database1;

use database1;
create table `業者`(`業者コード` char(4) not null,
				`業者名` char(20),
				`業者住所` char(40),
				primary key(業者コード));

create table `発注`(`注文コード` int not null, 
				`商品コード` char(4) not null,
				`業者コード` char(4) not null, 
				`数量` int,
				`発注日` date,
				primary key(注文コード));

create table `納入`(`注文コード` int not null, 
				`商品コード` char(4) not null,
				`業者コード` char(4) not null, 
				`数量` int,
				`納入日` date,
				primary key(注文コード));

create table `商品`(`商品コード` char(4) not null,
				`商品種類` char(20),
				`商品名` char(30),
				`販売価格` int,
				primary key(商品コード));

insert into 業者 values
('9876','田中商事','東京都港区'),
('1111','井上卸','川崎市川崎区'),
('7777','伊藤商店','神戸市灘区'),
('9641','山田産業','大阪市中央区'),
('6767','鈴木販売','名古屋市北区');

insert into 発注 values 
('0003','1233','9876','10','2021-09-01'),
('0002','1234','9876','20','2021-08-10'),
('0006','1235','9641','40','2021-10-25'),
('0004','2468','9641','200','2021-09-01'),
('0007','2468','9641','30','2021-11-02');

insert into 納入 values 
('0001','2468','9876','30','2021-09-01'),
('0000','1357','9876','50','2021-08-22'),
('0005','1234','9641','10','2021-10-12'),
('0003','1233','9876','10','2021-09-10');

insert into 商品 values 
('1233','食料品','食パン','200'),
('1234','日用品','セッケン','180'),
('1235','日用品','歯ブラシ','150'),
('3456','オフィス用品','イス','9000'),
('1357','冷凍食品','冷凍コロッケ','300'),
('2468','野菜','キャベツ','99');